{"pageProps":{"job":{"title":"Bank of Mauritius and Cisco","featuredImage":{"url":"https://media.graphcms.com/1S7a0hIFTmOcr5bNv2Ug"},"timePeriod":"May, 2009 to Feb, 2015","slug":"cisco","content":"> I joined Automation COE at Quinnox in 2012 as Senior Test Manager. My primary role was to steer head test automation service delivery for **Bank of Mauritius** account, and at the same time oversee test automation programs in other business critical accounts like **Barclays** and **Coca Cola**. \n\n- Successfully established the **center of excellence** to run and support test automation practices across multiple projects and business lines\n- Abstracted **test automation** frameworks and functions to reduce hard dependency on tools and technologies, locking terms with product vendors and to migrate from *commercial* to *open-sourced* products\n- Encouraged project teams to build *reusable* and *enduring* test assets\n- Collaborated with sales and pre-sales for steep *growth in business* and to create beachheads\n\n> In 2009, I moved from USA to India and joined **Asurion** project at Synechron Technologies. Managed IntelliSet and WITS projects. Helped both projects to move away from *waterfall methodology* towards *agile*. Same year in 2009, Zensar Technologies offered me a long-term opportunity to take over and manage end-to-end testing service delivery at **Cisco’s Quality Assurance Competency Center**. As a Test Manager at QACC, I managed three major tracks - BASE or Buying and Selling Enablement, C&CIT or Communication and Collaboration, and BI or Business Intelligence and was highly credited for reducing client escalations to zero, streamlining operations and continuously improving quality of delivered service. QACC’s **test automation** framework was later reused in other business critical accounts, for example in Prudential account, Ireland.","employers":[{"name":"Quinnox Consultancy Services","slug":"quinx"},{"name":"Zensar Technologies and Synechron","slug":"zensr"}]}},"__N_SSG":true}