{"pageProps":{"job":{"title":"Cox, Telstra and AT&T (India)","featuredImage":{"url":"https://media.graphcms.com/DX7IZoAMSheLp3TRWcoD"},"timePeriod":"Mar, 2015 to Aug, 2017","slug":"cox","content":"> I joined Cognizant’s **Technology Center of Excellence** in 2015. My role was to partner with business-critical accounts, to infuse engineering capabilities for assuring quality of software deployed, developed or under development, to reduce the overall test cycle time and automate operational models for customer delight. I led several long-term transformational initiatives around people, process, and technology across multiple lines of business, for example helping **Cox**, **Telstra ** and **AT&T** project teams to adopt digital and cloud-based technologies and tools, auto-generate test data, virtualize and mock web services, automate web and windows user interfaces, conduct performance and load testing, setup mobile test lab, etc. I also played critical role within DCOE practice in creating data, business component, and keyword driven frameworks and operating platforms. Major roles and responsibilities played at DCOE are below.\n\n- Worked as Technology Advisor for Cognizant’s Cox and Telstra accounts. Guided project teams and program managers in *test data management* and *web service virtualization* using appropriate tools, e.g., **Delphix**, **SoapUI**, **Parasoft**, etc. Partnered with Telstra to enable quality engineering and assurance teams in *script-less automation* using **TOSCA**.\n- Worked as Technology Partner for AT&T in rationalization of 200+ testing tools, which includes *commercial*, *home-grown*, *open-sourced* tools and utilities. I also played a major role in grooming digital engineers, within DCOE practice, in learning advanced technologies around **artificial intelligence**, **machine learning** and cognitive services, **blockchain**, etc. Partnered with multiple **microservice **development teams, within AT&T, to evangelize consumer driven contract testing using **PACT**.\n","employers":[{"name":"Cognizant Technologies","slug":"cognz"}]}},"__N_SSG":true}